Repository: Abhishekdhal/APP-NOTICE
Catalog: app_farming/lib/l10n/app_*.arb
Languages: or, pa

source: Welcome
or: ସ୍ୱାଗତ
pa: ਸਵਾਗਤ ਹੈ

# loginMessage
source: Please login to continue
or: ଦୟାକରି ଆଗକୁ ବଢିବା ପାଇଁ ଲଗଇନ୍ କରନ୍ତୁ
pa: ਕਿਰਪਾ ਕਰਕੇ ਅੱਗੇ ਵਧਣ ਲਈ ਲਾਗਇਨ ਕਰੋ

# continueButton
source: Continue
or: ଚାଲୁ ରଖନ୍ତୁ
pa: ਜਾਰੀ ਰੱਖੋ

# email
source: Email ID
or: ଇମେଲ୍ ID
pa: ਈਮੇਲ ID

source: Name
or: ନାମ
pa: ਨਾਂ

# phone
source: Phone Number
or: ଫୋନ୍ ନମ୍ବର
pa: ਫੋਨ ਨੰਬਰ

# language
source: Preferred Language
or: ପସନ୍ଦିଦା ଭାଷା
pa: ਪਸੰਦੀਦਾ ਭਾਸ਼ਾ

# fillAllFields
source: Please fill all fields
or: ଦୟାକରି ସମସ୍ତ ଫିଲ୍ଡ୍ ଭରନ୍ତୁ
pa: ਕਿਰਪਾ ਕਰਕੇ ਸਾਰੇ ਖੇਤਰ ਭਰੋ

# homeTitle
source: Farmers of India
or: ଭାରତର କୃଷକ
pa: ਭਾਰਤ ਦੇ ਕਿਸਾਨ

source: Supplements
or: ସପ୍ଲିମେଣ୍ଟ୍ସ
pa: ਸਪਲੀਮੈਂਟਸ

source: Weather
or: ଓଡ଼ିଆ ମୌସମ
pa: ਮੌਸਮ

source: AI Bot
or: ଏଆଇ ବୋଟ୍
pa: ਏਆਈ ਬੋਟ

source: Notice Board
or: ସୂଚନା ପଟ
pa: ਸੂਚਨਾ ਬੋਰਡ

source: IoT Farming
or: ଆଇଓଟି କୃଷି
pa: ਆਈਓਟੀ ਖੇਤੀ

source: Soil Health
or: ମୃତ୍ତିକା ସ୍ୱାସ୍ଥ୍ୟ
pa: ਮਿੱਟੀ ਸਿਹਤ

source: Market Prices
or: ବଜାର ମୂଲ୍ୟ
pa: ਬਾਜ਼ਾਰ ਕੀਮਤਾਂ

source: Crop Problem Detector
or: ଫସଲ ସମସ୍ୟା ଚିହ୍ନଟକାରୀ
pa: ਫਸਲ ਸਮੱਸਿਆ ਡਿਟੈਕਟਰ

source: Feedback
or: ମତାମତ
pa: ਫੀਡਬੈਕ

source: Ask AI Bot
or: ଏଆଇ ବୋଟ୍ ପ୍ରଶ୍ନ କରନ୍ତୁ
pa: ਏਆਈ ਬੋਟ ਤੋਂ ਪੁੱਛੋ

# soilHealthTitle
source: Soil Fertility Analyzer
or: ମୃଦା ଉର୍ବରତା ବିଶ୍ଳେଷକ
pa: ਮਿੱਟੀ ਉਪਜਾਵਣੀਤਾ ਵਿਸ਼ਲੇਸ਼ਕ

# enterValues
source: 🌱 Enter Soil Test Values
or: 🌱 ମୃଦା ପରୀକ୍ଷା ମୂଲ୍ୟ ଦାଖଳ କରନ୍ତୁ
pa: 🌱 ਮਿੱਟੀ ਟੈਸਟ ਮੁੱਲ ਦਰਜ ਕਰੋ

# phLabel
source: Soil pH (e.g., 6.5)
or: ମୃଦା pH (ଉଦାହରଣ: 6.5)
pa: ਮਿੱਟੀ pH (ਉਦਾਹਰਣ: 6.5)

# nLabel
source: Nitrogen (0-100)
or: ନାଇଟ୍ରୋଜେନ (0-100)
pa: ਨਾਈਟ੍ਰੋਜਨ (0-100)

# pLabel
source: Phosphorus (0-100)
or: ଫସଫୋରସ (0-100)
pa: ਫਾਸਫ਼ੋਰਸ (0-100)

# kLabel
source: Potassium (0-100)
or: ପଟାସିଆମ (0-100)
pa: ਪੋਟਾਸ਼ੀਅਮ (0-100)

# analyzeButton
source: Analyze Soil
or: ମୃଦା ବିଶ୍ଳେଷଣ
pa: ਮਿੱਟੀ ਜਾਂਚ ਕਰੋ

source: ✅ Best Practices
or: ✅ ସୁତାରୁ ପ୍ରଥା
pa: ✅ ਸਰਸ਼੍ਰੇਸ਼੍ਠ ਅਭਿਆਸ

# practice1
source: Use organic manure to improve soil structure.
or: ମୃଦା ଗଠନ ସୁଧାରିବାକୁ ଜୈବିକ ସର ଉପଯୋଗ କରନ୍ତୁ।
pa: ਮਿੱਟੀ ਦੀ ਬਣਤਰ ਸੁਧਾਰਣ ਲਈ ਜੈਵਿਕ ਖਾਦ ਵਰਤੋ।

# practice2
source: Rotate crops to maintain fertility.
or: ଫସଲ୍ ଚକ୍ର ପାଳନ କରନ୍ତୁ ଯାହାରେ ଉର୍ବରତା ରହିବ।
pa: ਉਪਜਾਵਣੀਤਾ ਬਰਕਰਾਰ ਰੱਖਣ ਲਈ ਫਸਲ ਚੱਕਰ ਕਰੋ।

# practice3
source: Avoid excessive use of chemical fertilizers.
or: ରସାୟନିକ ସରର ଅତି ପ୍ରୟୋଗରୁ ବଚନ୍ତୁ।
pa: ਰਸਾਇਣਕ ਖਾਦਾਂ ਦੀ ਬੇਸ਼ੁਮਾਰ ਵਰਤੋਂ ਤੋਂ ਬਚੋ।

# practice4
source: Test soil every 2-3 years for better planning.
or: ବେଟର ପ୍ଲାନିଙ୍ଗ ପାଇଁ ପ୍ରତି 2-3 ବର୍ଷରେ ମୃଦା ପରୀକ୍ଷା କରନ୍ତୁ।
pa: ਚੰਗੀ ਯੋਜਨਾ ਲਈ ਹਰ 2-3 ਸਾਲ ਵਿੱਚ ਮਿੱਟੀ ਦੀ ਜਾਂਚ ਕਰੋ।

# invalidValues
source: Please enter valid numeric values.
or: ଦୟାକରି ସଠିକ ସଂଖ୍ୟାତ୍ମକ ମୂଲ୍ୟ ଦାଖଳ କରନ୍ତୁ।
pa: ਕਿਰਪਾ ਕਰਕੇ ਵੈਧ ਨੰਬਰੀ ਮੁੱਲ ਦਰਜ ਕਰੋ।

# acidicSoil
source: Soil is acidic. Add lime. Crops: Potato, Pineapple, Rice.
or: ମୃଦା ଏସିଡିକ୍ ଅଛି। ଚୁନା ଯୋଗ କରନ୍ତୁ। ଫସଲ୍: ଆଳୁ, ଅନାନାସ, ଧାନ।
pa: ਮਿੱਟੀ ਅਮਲੀ ਹੈ। ਚੂਨਾ ਸ਼ਾਮਿਲ ਕਰੋ। ਫਸਲਾਂ: ਆਲੂ, ਅਨਾਨਾਸ, ਚਾਵਲ।

# alkalineSoil
source: Soil is alkaline. Add gypsum/organic matter. Crops: Cotton, Sugar beet, Barley.
or: ମୃଦା ଆଲ୍କାଲିନ୍ ଅଛି। ଜିପସମ/ଜୈବିକ ପଦାର୍ଥ ଯୋଗ କରନ୍ତୁ। ଫସଲ୍: କପାସ, ସୁଗରବିଟ୍, ବାର୍ଲି।
pa: ਮਿੱਟੀ ਖਾਰਾ ਹੈ। ਜਿਪਸਮ/ਜੈਵਿਕ ਪਦਾਰਥ ਸ਼ਾਮਿਲ ਕਰੋ। ਫਸਲਾਂ: ਰੂਈ, ਸ਼ੁਗਰ ਬੀਟ, ਜੌ।

# goodSoil
source: Soil pH is good for most crops.
or: ଅଧିକାଂଶ ଫସଲ୍ ପାଇଁ pH ଭଲ ଅଛି।
pa: ਅਧਿਕਤਮ ਫਸਲਾਂ ਲਈ pH ਠੀਕ ਹੈ।

# addN
source: Add Urea (Nitrogen).
or: ୟୁରିଆ ଯୋଗ କରନ୍ତୁ (ନାଇଟ୍ରୋଜେନ)।
pa: ਯੂਰਿਆ ਸ਼ਾਮਿਲ ਕਰੋ (ਨਾਈਟ੍ਰੋਜਨ)।

# addP
source: Add DAP (Phosphorus).
or: DAP ଯୋଗ କରନ୍ତୁ (ଫସଫୋରସ)।
pa: DAP ਸ਼ਾਮਿਲ ਕਰੋ (ਫਾਸਫ਼ੋਰਸ)।

# addK
source: Add MOP (Potassium).
or: MOP ଯୋଗ କରନ୍ତୁ (ପଟାସିଆମ)।
pa: MOP ਸ਼ਾਮਿਲ ਕਰੋ (ਪੋਟਾਸ਼ੀਅਮ)।

# balancedNPK
source: NPK levels are balanced. Maintain with compost.
or: NPK ସ୍ତର ସମତୁଳିତ ଅଛି। କମ୍ପୋଷ୍ଟ ସହିତ ରକ୍ଷା କରନ୍ତୁ।
pa: NPK ਪੱਧਰ ਸੰਤੁਲਿਤ ਹਨ। ਕਾਂਪੋਸਟ ਨਾਲ ਰੱਖੋ।

# marketTitle
source: 🌾 Market Prices
or: 🌾 ବଜାର ଦର
pa: 🌾 ਮਾਰਕੀਟ ਕੀਮਤਾਂ

# tabFertilizers
source: Fertilizers
or: ସାର
pa: ਖਾਦ

# tabSeeds
source: Seeds
or: ବିଆ
pa: ਬੀਜ

# tabSprays
source: Sprays
or: ଛିଟା
pa: ਛਿੜਕਾਅ

# tabNutrients
source: Nutrients
or: ପୋଷକ
pa: ਪੋਸ਼ਕ ਤੱਤ

# bestLabel
source: Best
or: ସର୍ବଶ୍ରେଷ୍ଠ
pa: ਸਭ ਤੋਂ ਵਧੀਆ

source: Amazon
or: ଆମାଜନ୍
pa: ਐਮੇਜ਼ਾਨ

source: Flipkart
or: ଫ୍ଲିପକାର୍ଟ
pa: ਫਲਿਪਕਾਰਟ

source: Mandi
or: ମଣ୍ଡି
pa: ਮੰਡੀ

# day
source: Day {value}
or: ଦିନ {value}
pa: ਦਿਨ {value}

# iotTitle
source: IoT-based Farming
or: ଆଇଓଟି-ଆଧାରିତ ଚାଷ
pa: ਆਈਓਟੀ-ਅਧਾਰਤ ਖੇਤੀ

# iotDescription
source: Soil suitability analysis using IoT devices.
or: ଆଇଓଟି ଉପକରଣ ବ୍ୟବହାର କରି ମାଟିର ଉପଯୁକ୍ତତା ବିଶ୍ଳେଷଣ।
pa: ਆਈਓਟੀ ਡਿਵਾਈਸਾਂ ਦੀ ਵਰਤੋਂ ਕਰਕੇ ਮਿੱਟੀ ਦੀ ਅਨੁਕੂਲਤਾ ਵਿਸ਼ਲੇਸ਼ਣ।

# feedbackTitle
source: 💬 Feedback
or: 💬 ମତାମତ
pa: 💬 ਫੀਡਬੈਕ

# feedbackHeader
source: We value your feedback 💚
or: ଆମେ ଆପଣଙ୍କ ମତାମତକୁ ଗୁରୁତ୍ୱ ଦେଉଛୁ 💚
pa: ਅਸੀਂ ਤੁਹਾਡੀ ਫੀਡਬੈਕ ਦੀ ਕਦਰ ਕਰਦੇ ਹਾਂ 💚

source: Your Name
or: ଆପଣଙ୍କ ନାମ
pa: ਤੁਹਾਡਾ ਨਾਮ

source: Your Feedback
or: ଆପଣଙ୍କ ମତାମତ
pa: ਤੁਹਾਡੀ ਫੀਡਬੈਕ

# noImage
source: 📷 No image selected
or: 📷 କୌଣସି ଛବି ମନୋନୀତ ହୋଇନାହିଁ
pa: 📷 ਕੋਈ ਚਿੱਤਰ ਨਹੀਂ ਚੁਣਿਆ ਗਿਆ

source: Upload Photo
or: ଫଟୋ ଅପଲୋଡ୍ କରନ୍ତୁ

source: Submit Feedback
or: ମତାମତ ଦାଖଲ କରନ୍ତୁ

source: 🎉 Thank You!
or: 🎉 ଧନ୍ୟବାଦ!

# thankYouMessage
source: Your feedback has been submitted successfully. We appreciate your time 💚
or: ଆପଣଙ୍କ ମତାମତ ସଫଳତାର ସହିତ ଦାଖଲ ହୋଇଛି। ଆମେ ଆପଣଙ୍କ ସମୟକୁ ପ୍ରଶଂସା କରୁଛୁ 💚

source: OK
or: ଠିକ୍ ଅଛି

# pleaseEnter
source: ⚠️ Please enter name and feedback
or: ⚠️ ଦୟାକରି ନାମ ଏବଂ ମତାମତ ଦିଅନ୍ତୁ

# problemDetectorTitle
source: Problem Detector
or: ସମସ୍ୟା ଚିହ୍ନଟକାରୀ

source: Problem Description
or: ସମସ୍ୟା ବର୍ଣ୍ଣନା

source: No image selected
or: କୌଣସି ଛବି ମନୋନୀତ ହୋଇନାହିଁ

source: Take/Choose Image
or: ଛବି ନିଅନ୍ତୁ/ଚୟନ କରନ୍ତୁ
pa: ਚਿੱਤਰ ਲਓ/ਚੁਣੋ

source: UPLOAD
or: ଅପଲୋଡ୍ କରନ୍ତୁ
pa: ਅਪਲੋਡ ਕਰੋ

# addDescriptionAndImage
source: Please add description and image ❌
or: ଦୟାକରି ବର୍ଣ୍ଣନା ଏବଂ ଛବି ଯୋଡନ୍ତୁ ❌
pa: ਕਿਰਪਾ ਕਰਕੇ ਵੇਰਵਾ ਅਤੇ ਚਿੱਤਰ ਸ਼ਾਮਲ ਕਰੋ ❌

# problemReportedSuccess
source: Problem reported successfully ✅
or: ସମସ୍ୟା ସଫଳତାର ସହିତ ରିପୋର୍ଟ ହେଲା ✅
pa: ਸਮੱਸਿਆ ਸਫਲਤਾਪੂਰਵਕ ਰਿਪੋਰਟ ਕੀਤੀ ਗਈ ✅

source: Error ❌
or: ତ୍ରୁଟି ❌
pa: ਗਲਤੀ ❌

# weatherTitle
source: Weather
or: ପାଣିପାଗ
pa: ਮੌਸਮ

# farmingTip_rain
source: 🌧 Good for paddy and rice crops. Avoid pesticide spraying today.
or: 🌧 ଧାନ ଓ ଚାଉଳ ଚାଷ ପାଇଁ ଭଲ। ଆଜି କୀଟନାଶକ ଛିଟିବେନି।
pa: 🌧 ਧਾਨ ਅਤੇ ਚਾਵਲ ਲਈ ਵਧੀਆ। ਅੱਜ ਕੀਟਨਾਸ਼ਕ ਛਿੜਕਾਅ ਨਾ ਕਰੋ।

# farmingTip_hot
source: ☀️ Too hot! Irrigation is required to protect young plants.
or: ☀️ ବହୁତ ଗରମ! ଚାଷକୁ ସୁରକ୍ଷା କରିବାକୁ ସିଚାଇ ଦରକାର।
pa: ☀️ ਬਹੁਤ ਗਰਮੀ ਹੈ! ਫਸਲਾਂ ਨੂੰ ਬਚਾਉਣ ਲਈ ਸਿੰਚਾਈ ਦੀ ਲੋੜ ਹੈ।

# farmingTip_sunny
source: ☀️ Sunny day, good for harvesting and drying crops.
or: ☀️ ସୂର୍ଯ୍ୟୋଦୟ – କଟାନ୍ତ ଓ ଫସଲ ସୁକାଇବା ପାଇଁ ଭଲ।
pa: ☀️ ਧੁੱਪ ਵਾਲਾ ਦਿਨ – ਫਸਲ ਕੱਟਣ ਅਤੇ ਸੁਕਾਉਣ ਲਈ ਵਧੀਆ।

# farmingTip_cloudy
source: 🌥 Cloudy skies – good day for sowing seeds, soil moisture will remain.
or: 🌥 ମେଘାଚ୍ଛନ୍ନ – ମଣ୍ଡିଆ ପାଇଁ ଭଲ ଦିନ।
pa: 🌥 ਬੱਦਲਾਂ ਵਾਲਾ ਦਿਨ – ਬੀਜ ਬੀਜਣ ਲਈ ਵਧੀਆ।

# farmingTip_humidity
source: 💧 High humidity – watch out for fungal diseases in crops.
or: 💧 ଅଧିକ ଆର୍ଦ୍ରତା – ଫସଲରେ ଫଙ୍ଗସ ରୋଗକୁ ସାବଧାନ।
pa: 💧 ਜ਼ਿਆਦਾ ਨਮੀ – ਫਸਲਾਂ ਵਿੱਚ ਫਫੂੰਦੀ ਤੋਂ ਸਾਵਧਾਨ।

# farmingTip_normal
source: 🌱 Normal conditions – good for regular farming activities.
or: 🌱 ସାଧାରଣ ଆବହାଓ – ସାଧାରଣ ଚାଷ କାମ ପାଇଁ ଭଲ।
pa: 🌱 ਆਮ ਮੌਸਮ – ਖੇਤੀ ਦੇ ਆਮ ਕੰਮਾਂ ਲਈ ਵਧੀਆ।
